%% Variant

i = 4;
K = mod(i, 24) + 1

%% Privod K1 constants NOT_WORK!!!
% 
l_1 = 0.55; % м
Ixx_1 = 9.4; % кг*м^2
Iyy_1 = 9.4; % кг*м^2
Izz_1 = 0.7; % кг*м^2
m_1 = 46; % кг
d_1 = 19.4; % см
K1_1 = 38.80;
K2_1 = 2.94;
K3_1 = 9.6;
K4_1 = 0.044;
K5_1 = 15.6;

% l_1 = 0.55; % м
% Ixx_1 = 9.4; % кг*м^2
% Iyy_1 = 9.4; % кг*м^2
% Izz_1 = 0.7; % кг*м^2
% m_1 = 46; % кг
% d_1 = 19.4; % см
% K1_1 = 10;
% K2_1 = 10;
% K3_1 = 300;
% K4_1 = 0.5;
% K5_1 = 10;

%% Privod K2 constants NOT WORK!!!

l_2 = 0.55; % м
Ixx_2 = 16.5; % кг*м^2
Iyy_2 = 16.5; % кг*м^2
Izz_2 = 0.7; % кг*м^2
m_2 = 78; % кг
d_2 = 24.7; % см
K1_2 = 23.30;
K2_2 = 2.8;
K3_2 = 11.7;
K4_2 = 0.043;
K5_2 = 9.4;

% l_2 = 0.55; % м
% Ixx_2 = 16.5; % кг*м^2
% Iyy_2 = 16.5; % кг*м^2
% Izz_2 = 0.7; % кг*м^2
% m_2 = 78; % кг
% d_2 = 24.7; % см
% K1_2 = 10;
% K2_2 = 50;
% K3_2 = 100 / 1000;
% K4_2 = 0.5;
% K5_2 = 15;

%% Privod P constants

l_3 = 0.875; % м
Ixx_3 = 33.3; % кг*м^2
Iyy_3 = 33.3; % кг*м^2
Izz_3 = 9.1; % кг*м^2
m_3 = 194; % кг
d_3 = 30.2; % см
K1_3 = 4202;
K2_3 = 2.97;
K3_3 = 120;
K4_3 = 0.055;
K5_3 = 0.168;

%% Privod T constants

l_4 = 0.785; % м
Ixx_4 = 5.8; % кг*м^2
Iyy_4 = 5.8; % кг*м^2
Izz_4 = 0.6; % кг*м^2
m_4 = 26; % кг
d_4 = 4.8; % см
K1_4 = 1950;
K2_4 = 0.275;
K3_4 = 200;
K4_4 = 0.05;
K5_4 = 78;

%% Solid block 1-st
x_block = 0.1;
y_block = 0.1;
z_block = 0.1;

